In [1]:
# p249 ~250 연습문제 4번,5번
import pandas as pd

In [2]:
patiend_data = {
    "환자명":["환자A","환자B","환자C"],
    "나이":[24, 18, 21],
    "성별":["여","여","남"],
    "수축기":[143,119,130],
    "이완기":[110,78,83]
}
df = pd.DataFrame(patiend_data)
df

   환자명  나이 성별  수축기  이완기
0  환자A  24  여  143  110
1  환자B  18  여  119   78
2  환자C  21  남  130   83

In [3]:
#249 4번 행과 열 위치 변경
df1 = df.transpose()
df1

       0    1    2
환자명  환자A  환자B  환자C
나이    24   18   21
성별     여    여    남
수축기  143  119  130
이완기  110   78   83

In [11]:
# 250p 5번 : 행(환자B)과 열(성명)삭제
# 연습문제 3번 drop(이름,이름,axis=0/1, inplace=True)
# axis=0 : 행 삭제, axis=1 : 열 삭제

# 1.환자B 행 삭제
df2 = df.copy()
df2.set_index("환자명",inplace=True)
df2

     나이 성별  수축기  이완기
환자명
환자A  24  여  143  110
환자B  18  여  119   78
환자C  21  남  130   83

In [12]:
# 2.환자B 행 삭제
df2.drop("환자B",axis=0,inplace=True)
df2

     나이 성별  수축기  이완기
환자명
환자A  24  여  143  110
환자C  21  남  130   83

In [13]:
# 3. 성별 열 삭제
df2.drop("성별",axis=1,inplace=True)
df2

     나이  수축기  이완기
환자명
환자A  24  143  110
환자C  21  130   83